Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/drupal-tm.tmx
Source language: en
Languages: ca_es

source: This image style is being provided by %module module and may not be renamed.
ca_es: Aquest estil d'imatge el proporciona el mòdul %module i no es pot canviar el nom.

source: The name is used in URLs for generated images. Use only lowercase alphanumeric characters, underscores (_), and hyphens (-).
ca_es: El nom s'utilitza a les URLs de les imatges generades. Utilitzeu només caràcters alfanumèrics en minúscula, guions baixos (_) i guionets(-).

source: Select a new effect
ca_es: Selecciona un nou efecte

source: Override defaults
ca_es: Sobreescriu els valors per defecte

source: Update style
ca_es: Actualitza l'estil

source: Select an effect to add.
ca_es: Seleccioneu un efecte per afegir-lo.

source: The image effect was successfully applied.
ca_es: S'ha aplicat correctament l'efecte d'imatge.

source: The %style style has been overridden, allowing you to change its settings.
ca_es: L'estil %style ha estat sobreescrit, el que us permetent canviar els seus paràmetres.

source: Style name
ca_es: Nom de l'estil

source: Create new style
ca_es: Crea un nou estil

source: Style %name was created.
ca_es: S'ha creat l'estil %name.

source: The image style name %name is already in use.
ca_es: El nom de l'estil d'imatge %name ja està en ús.

source: Please only use lowercase alphanumeric characters, underscores (_), and hyphens (-) for style names.
ca_es: Useu només caràcters alfanumèrics en minúscules, guions baixos (_) i guions (-) pels noms d'estils.

source: No replacement, just delete
ca_es: Sense reemplaçament, simplement esborra

source: Replacement style
ca_es: Estil de reemplaçament

source: Optionally select a style before deleting %style
ca_es: Seleccioneu, de forma opcional, un estil abans de suprimir %style

source: If this style is in use on the site, you may select another style to replace it. All images that have been generated for this style will be permanently deleted.
ca_es: Si aquest estil està essent utilitzant al lloc, podeu seleccionat un altre estil per a reemplaçar-lo. Totes les imatges que han estat generades per aquest estil se suprimiran de forma permanent.

source: Style %name was deleted.
ca_es: S'ha suprimit l'estil %name.

source: Revert the %style style?
ca_es: Restablir l'estil %style?

source: Reverting this style will delete the customized settings and restore the defaults provided by the @module module.
ca_es: El restabliment de l'estil suprimirà els paràmetres personalitzats i restaurarà els predeterminats proporcionats pel mòdul @module.

source: The %style style has been revert to its defaults.
ca_es: L'estil %style ha estat restablert als valors predeterminats.

source: Edit %label effect
ca_es: Edita l'efecte %label

source: Add %label effect
ca_es: Afegeix l'efecte %label

source: Update effect
ca_es: Actualitza l'efecte

source: Add effect
ca_es: Afegeix l'efecte

source: Are you sure you want to delete the @effect effect from the %style style?
ca_es: Esteu segur de voler suprimir l'efecte @effect de l'estil %style?

source: The image effect %name has been deleted.
ca_es: S'ha suprimit l'efecte d'imatge %name.

source: !name must be an integer.
ca_es: !name ha de ser un enter.

source: !name must be a positive integer.
ca_es: !name ha de ser un enter positiu.

source: !name must be a hexadecimal color value.
ca_es: !name ha de ser un valor de color en hexadecimal.

source: Width and height can not both be blank.
ca_es: L'amplada i l'alçada no poden ser ambdues buides.

source: The part of the image that will be retained during the crop.
ca_es: La part de la imatge que es mantindrà durant el procés de tallat.

source: The background color to use for exposed areas of the image. Use web-style hex colors (#FFFFFF for white, #000000 for black). Leave blank for transparency on image types that support it.
ca_es: El color de fons que s'usarà per a les parts exposades de la imatge. Utilitzeu colors en estil web en hexadecimal (#FFFFFF pel blanc, #000000 pel negre). Deixeu-ho en blanc per a transparència als tipus d'imatge que ho suportin.

source: There are currently no styles. <a href="!url">Add a new one</a>.
ca_es: Actualment no hi ha cap estil. <a href="!url">Afegiu-ne un</a>.

source: There are currently no effects in this style. Add one by selecting an option below.
ca_es: Actualment no hi ha efectes en aquest estil. Afegiu-ne un seleccionant una opció de sota.

source: view actual size
ca_es: veure en mida real

source: Sample original image
ca_es: Imatge original d'exemple

source: Sample modified image
ca_es: Imatge modificada d'exemple

source: Resizing will make images an exact set of dimensions. This may cause images to be stretched or shrunk disproportionately.
ca_es: El redimensionat farà les imatges d'unes mides exactes. Això pot causar que les imatges s'estreteixin o s'estirin desproporcionadament.

source: Scaling will maintain the aspect-ratio of the original image. If only a single dimension is specified, the other dimension will be calculated.
ca_es: L'escalat mantindrà la relació d'aspecte de la imatge original. Si només s'especifica una sola dimensió, l'altra serà calculada.

source: Scale and crop
ca_es: Escalar i tallar

source: Scale and crop will maintain the aspect-ratio of the original image, then crop the larger dimension. This is most useful for creating perfectly square thumbnails without stretching the image.
ca_es: L'escalat i tallat mantindrà la relació d'aspecte de la imatge i tallarà el que sobri per la part més gran. Això és útil per a crear miniatures quadrades exactes sense estirar la imatge.

source: Cropping will remove portions of an image to make it the specified dimensions.
ca_es: El tallat eliminarà les porcions d'una imatge per a fer-la de les dimensions especificades.

source: Desaturate
ca_es: Desaturar

source: Desaturate converts an image to grayscale.
ca_es: La desaturació transforma una imatge a escala de grisos.

source: Rotating an image may cause the dimensions of an image to increase to fit the diagonal.
ca_es: La rotació d'una imatge farà que les seves dimensions augmentin per a encaixar la diagonal.

source: Image resize failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
ca_es: Ha fallat el redimensionat de la imatge utilitzant el joc d'eines %toolkit a %path (%mimetype, %dimensions)

source: Image scale failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
ca_es: Ha fallat l'escalat de la imatge utilitzant el joc d'eines %toolkit a %path (%mimetype, %dimensions)

source: Image crop failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
ca_es: Ha fallat el tallat de la imatge utilitzant el joc d'eines %toolkit a %path (%mimetype, %dimensions)

source: Image scale and crop failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
ca_es: Ha fallat l'escalat i el tallat de la imatge utilitzant el joc d'eines %toolkit a %path (%mimetype, %dimensions)

source: Image desaturate failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
ca_es: Ha fallat el desaturat de la imatge utilitzant el joc d'eines %toolkit a %path (%mimetype, %dimensions)

source: Image rotate failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
ca_es: Ha fallat la rotació de la imatge utilitzant el joc d'eines %toolkit a %path (%mimetype, %dimensions)

source: This field stores the ID of an image file as an integer value.
ca_es: El camp emmagatzema l'ID d'una imatge com un valor enter.

source: If no image is uploaded, this image will be shown on display.
ca_es: Si no es carrega cap imatge, al visualitzar el contingut es mostrarà aquesta.

source: The maximum allowed image size expressed as WIDTHxHEIGHT (e.g. 640x480). Leave blank for no restriction. If a larger image is uploaded, it will be resized to reflect the given width and height. Resizing images on upload will cause the loss of <a href="http://en.wikipedia.org/wiki/Exchangeable_image_file_format">EXIF data</a> in the image.
ca_es: La mida màxima de la imatge permesa en AMPLADAxALÇADA (p.ex. 640x480). Deixeu-ho en blanc per no tenir cap restricció. Si es carrega una imatge més gran, es redimensionarà per a adoptar l'amplada i l'alçada establertes. El redimensionat d'imatges durant la càrrega farà que es perdin les <a href="http://en.wikipedia.org/wiki/Exchangeable_image_file_format">dades EXIF</a> de la imatge.

source: Minimum image resolution
ca_es: Resolució mínima de la imatge

source: The minimum allowed image size expressed as WIDTHxHEIGHT (e.g. 640x480). Leave blank for no restriction. If a smaller image is uploaded, it will be rejected.
ca_es: La mida mínima de la imatge permesa expressada en AMPLADAxALÇADA (p.ex. 640x480). Deixeu-ho en blanc per no tenir cap restricció. Si es carrega una imatge més petita, es rebutjarà.

source: Enable <em>Alt</em> field
ca_es: Habilita el camp <em>Alt</em>

source: The alt attribute may be used by search engines, screen readers, and when the image cannot be loaded.
ca_es: L'atribut alt pot ser utilitzat pels cercadors, els lectors de pantalla i quan la imatge no s'ha pogut carregar.

source: Enable <em>Title</em> field
ca_es: Habilita el camp <em>Títol</em>

source: The title attribute is used as a tooltip when the mouse hovers over the image.
ca_es: L'atribut títol s'utilitza com a rètol emergent quan el ratolí passa per sobre de la imatge.

source: Height and width values must be numeric.
ca_es: L'amplada i l'alçada han de ser valors numèrics.

source: Both a height and width value must be specified in the !name field.
ca_es: Els valors de l'alçada i l'amplada s'han d'especificar en el camp !field.

source: Preview image style
ca_es: Estil de la previsualització de la imatge

source: no preview
ca_es: sense previsualització

source: The preview image will be shown while editing the content.
ca_es: La previsualització de la imatge es mostra mentre s'edita el contingut.

source: Image linked to content
ca_es: Imatge enllaçada al contingut

source: Image "@style"
ca_es: Imatge "@style"

source: Image "@style" linked to content
ca_es: Imatge "@style" enllaçada al contingut

source: Image "@style" linked to file
ca_es: Imatge "@style" enllaçada al fitxer

source: The Image module allows you to manipulate images on your website. It exposes a setting for using the <em>Image toolkit</em>, allows you to configure <em>Image styles</em> that can be used for resizing or adjusting images on display, and provides an <em>Image</em> field for attaching images to content. For more information, see the online handbook entry for <a href="@image">Image module</a>.
ca_es: El mòdul Image us permet manipular les imatges al vostre lloc web. S'exposa un marc per a l'ús del <em>Joc d'eines d'imatge</em>, us permet configurar els <em>Estils d'imatge</em> que poden utilitzar-se per redimensionar o ajustar les imatges a la pantalla i proporciona un camp <em>Imatge</em> per adjuntar imatges al contingut. Per a més informació, aneu a la secció del <a href="@image">mòdul Image</a> del manual en línia.

source: Manipulating images
ca_es: Manipulació d'imatges

source: With the Image module you can scale, crop, resize, rotate and desaturate images without affecting the original image using <a href="@image">image styles</a>. When you change an image style, the module automatically refreshes all created images. Every image style must have a name, which will be used in the URL of the generated images. There are two common approaches to naming image styles (which you use will depend on how the image style is being applied):
ca_es: Amb el mòdul Image podeu escalar, tallar, redimensionar, rotar i desaturar imatges sense afectar la imatge original utilitzant <a href="@image">estils d'imatge</a>. Quan canvieu un estil d'imatge, el mòdul actualitza automàticament totes les imatges creades. Cada estil d'imatge ha de tenir un nom, utilitzat a la URL de les imatges generades. Hi ha dos enfocaments comuns per donar nom als estils d'imatge (l'ús dependrà de com s'està aplicant l'estil d'imatge):

source: Based on where it will be used: eg. <em>profile-picture</em>
ca_es: Segons el lloc on s'utilitzarà: p.e. <em>imatge-perfil</em>

source: Describing its appearance: eg. <em>square-85x85</em>
ca_es: Descrivint la seva aparença: p.e. <em>quadrada-85x85</em>

source: After you create an image style, you can add effects: crop, scale, resize, rotate, desaturate, and rotate (other contributed modules provide additional effects). For example, by combining effects as crop, scale, and desaturate, you can create square, grayscale thumbnails.
ca_es: Una vegada hàgiu creat un estil d'imatge, podeu afegir-li efectes: tallar, escalar, redimensionar, rotar, desaturar i rotar (altres mòduls contribuïts proporcionen efectes addicionals). Per exemple, combinant efectes com tallar, escalar i desaturar, podeu crear miniatures quadrades amb escala de grisos.

source: Attaching images to content as fields
ca_es: Adjunció d'imatges al contingut com a camps

source: Image module also allows you to attach images to content as fields. To add an image field to a <a href='@content-type'>content type</a>, go to the content type's <em>manage fields</em> page, and add a new field of type <em>Image</em>. Attaching images to content this way allows image styles to be applied and maintained, and also allows you more flexibility when theming.
ca_es: El mòdul Image també us permet d'adjuntar imatges al contingut com a camps. Per afegir una imatge a un <a href="@content-type">tipus de contingut</a>, aneu a la pàgina de <em>gestió dels camps</em> del tipus de contingut, i afegiu un nou camp de tipus <em>Imatge</em>. Al adjuntar les imatges al contingut d'aquesta forma permeteu que s'apliquin i es mantinguin els estils d'imatges, i també us permet més flexibilitat a l'hora de crear el tema.

source: Image styles commonly provide thumbnail sizes by scaling and cropping images, but can also add various effects before an image is displayed. When an image is displayed with a style, a new file is created and the original image is left unchanged.
ca_es: Els estils d'imatge solen proporcionar les miniatures de les imatges escalant-les i tallant-les, però també poden afegir diversos efectes abans de que es mostri una imatge. Quan es mostra una imatge amb un estil, es crea un nou fitxer i la imatge original es manté sense canvis.

source: Administer image styles
ca_es: Administra els estils d'imatge

source: Create and modify styles for generating image modifications such as thumbnails.
ca_es: Creeu i modifiqueu els estils per generar modificacions d'imatge com poden ser les miniatures.

source: No defined styles
ca_es: No hi ha estils definits

source: Image generation in progress. Try again shortly.
ca_es: Generació de la imatge en progrés. Torneu-ho a provar en breu.

source: Error generating image.
ca_es: Error al generar la imatge.

source: Unable to generate the derived image located at %path.
ca_es: No s'ha pogut generar la imatge derivada que es troba a %path.

source: Failed to create style directory: %directory
ca_es: No s'ha pogut crear el directori d'estil: %directory

source: Cached image file %destination already exists. There may be an issue with your rewrite configuration.
ca_es: Ja existeix el fitxer d'imatge de memòria cau %destination. Pot haver-hi un problema amb la configuració de reescriptura.

source: Generate image style
ca_es: Genera l'estil d'imatge

source: Image styles
ca_es: Estils d'imatge

source: Configure styles that can be used for resizing or adjusting images on display.
ca_es: Configureu els estils que es poden usar per a redimensionar o ajustar les imatges a la pantalla.

source: List the current image styles on the site.
ca_es: Llisteu els estils d'imatge actuals del lloc.

source: Add style
ca_es: Afegeix un estil

source: Add a new image style.
ca_es: Afegeix un nou estil d'imatge

source: Configure an image style.
ca_es: Configureu un estil d'imatge.

source: Delete an image style.
ca_es: Suprimiu un estil d'imatge.

source: Revert style
ca_es: Torna a l'estil anterior

source: Revert an image style.
ca_es: Torneu a un estil anterior.

source: Edit image effect
ca_es: Edita un efecte d'imatge

source: Edit an exiting effect within a style.
ca_es: Editeu un efecte que ja existeix d'un estil.

source: Delete image effect
ca_es: Suprimeix l'efecte d'imatge

source: Delete an exiting effect from a style.
ca_es: Suprimiu un efecte que ja existeix d'un estil.

source: Add image effect
ca_es: Afegeix un efecte d'imatge

source: Add a new effect to a style.
ca_es: Afegiu un nou efecte a un estil.

source: Provides image manipulation tools.
ca_es: Proporciona eines de manipulació d'imatges.

source: Use the <em>Custom language</em> section below if your desired language does not appear in this list.
ca_es: Utilitzeu la següent secció de <em>Llengua personalitzada</em> si la llengua que voleu no apareix en aquesta llista.

source: Path prefix language code
ca_es: Prefix del camí per al codi de llengua

source: Language code or other custom text to use as a path prefix for URL language detection, if your <em>Detection and selection</em> settings use URL path prefixes. For the default language, this value may be left blank. <strong>Modifying this value may break existing URLs. Use with caution in a production environment.</strong> Example: Specifying "deutsch" as the path prefix code for German results in URLs like "example.com/deutsch/contact".
ca_es: Codi de llengua o qualsevol altre text per a utilitzar com a prefix del camí per a detecció de llengua per URL, si el vostre paràmetres de <em>Detecció i selecció</em> utilitza prefixos de camí URL. Per a la llengua predeterminada, podeu deixar aquest valor en blanc. <strong>La modificació d'aquest valor pot trencar camins que ja existeixen. Utilitzeu-lo amb precaució en entorns de producció.</strong> Exemple: especificant "alemany" com a codi prefix de camí per a l'Alemany, resulta en URLS com "example.com/alemany/contact".

source: URL <strong>including protocol</strong> to use for this language, if your <em>Detection and selection</em> settings use URL domains. For the default language, this value may be left blank. <strong>Modifying this value may break existing URLs. Use with caution in a production environment.</strong> Example: Specifying "http://example.de" or "http://de.example.com" as language domains for German results in URLs like "http://example.de/contact" and "http://de.example.com/contact", respectively.
ca_es: URL <strong>incloent el protocol</strong> per a utilitzar per aquesta llengua, si el paràmetre de <em>Detecció i selecció</em> utilitza dominis URL. Per a la llengua predeterminada, podeu deixar aquest valor en blanc. <strong>La modificació d'aquest valor pot trencar camins que ja existeixen. Utilitzeu-lo amb precaució en entorns de producció.</strong> Exemple: especificant "http://example.de" o "http://de.example.com" com a dominis de llengua per a l'Alemany, resulta en URLS com "example.de/contact" i "http://de.example.com/contact", respectivament.

source: Detection method
ca_es: Mètode de detecció

source: Part of the URL that determines language
ca_es: Part de la URL que determina la llengua

source: <em>Path prefix</em>: URLs like http://example.com/de/contact set language to German (de). <em>Domain</em>: URLs like http://de.example.com/contact set the language to German. <strong>Warning: Changing this setting may break incoming URLs. Use with caution on a production site.</strong>
ca_es: <em>Prefix del camí</em>: URLs com per exemple http://example.com/de/contaxt estableixen la llengua a l'Alemany (de). <em>Domini</em>: URLS com per exemple http://de.example.com/contact estableixen la llengua a Alemany. <strong>Avís: el canvi d'aquest paràmetre pot trencar URLs entrants. Utilitzeu-ho amb precaució en llocs en producció.</strong>

source: Request/session parameter
ca_es: Paràmetre de petició/sessió

source: Name of the request/session parameter used to determine the desired language.
ca_es: Nom del paràmetre de petició/sessió utilitzat per a determinat la llengua desitjada.

source: Filter translatable strings
ca_es: Filtra les cadenes que es poden traduir

source: Date type
ca_es: Tipus de data

source: Are you sure you want to reset the date formats for %language to the global defaults?
ca_es: Esteu segur de voler restablir els formats de data als predeterminats globals per al %language?

source: Resetting will remove all localized date formats for this language. This action cannot be undone.
ca_es: El restabliment esborrarà tots els formats de dates localitzats per aquesta llengua. Aquesta acció no es pot desfer.

source: The Locale module allows your Drupal site to be presented in languages other than the default English, and to be multilingual. The Locale module works by maintaining a database of translations, and examining text as it is about to be displayed. When a translation of the text is available in the language to be displayed, the translation is displayed rather than the original text. When a translation is unavailable, the original text is displayed, and then stored for review by a translator. For more information, see the online handbook entry for <a href="@locale">Locale module</a>.
ca_es: El mòdul Locale permet que el vostre lloc Drupal pugui presentar-se en altres llengües a més de l'anglès predeterminat, i pugui ser multilingüe. El mòdul Locale funciona mitjançant el manteniment d'una base de dades de traduccions i examinant el text quan està a punt de mostrar-se. Quan hi hagi una traducció del text disponible en la llengua que ha de mostrar-se, es mostra la traducció en comptes del text original. Quan no hi hagi una traducció disponible, es mostrarà el text original, i s'emmagatzemarà per a una revisió posterior per part del traductor. Per a més informació, aneu a la secció del <a href="@locale">mòdul Locale</a> del manual en línia.

source: Translating interface text
ca_es: Traducció del text de la interfície

source: Translations of text in the Drupal interface may be provided by:
ca_es: Les traduccions del text de la interfície del Drupal poden ser proporcionades per:

source: Translating within your site, using the Locale module's integrated <a href='@translate'>translation interface</a>.
ca_es: Traduint al vostre lloc, utilitzant la <a href="@translate">interfície de traducció</a> integrada del mòdul Locale.

source: Importing files from a set of existing translations, known as a translation package. A translation package enables the display of a specific version of Drupal in a specific language, and contains files in the Gettext Portable Object (<em>.po</em>) format. Although not all languages are available for every version of Drupal, translation packages for many languages are available for download from the <a href="@translations">Drupal translations page</a>.
ca_es: Important fitxers d'un grup de traduccions existents, conegut com a paquet de traducció. Un paquet de traducció habilita la presentació d'una versió específica del Drupal en una llengua concreta, i conté fitxers en format Gettext Portable Object (<em>.po</em>). Tot i que no totes les llengües estan disponibles per a totes les versions del Drupal, els paquets de traducció de moltes llengües estan disponibles per descarregar a la pàgina de <a href="@translations">traduccions del Drupal</a>.
